app/views/companies/show.html.erb

<div class="company-comments">
	<% @company.reviews.each do |review|%>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."company_id" = $1  [["company_id", 213]]