app/controllers/comments_controller.rb

	def new
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]

  def create
    @review = Review.find(params[:id])
    @comment = @review.comments.new (comments_params)
    @comment.commentor_id = current_user.id
    if @comment.save
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "commentor_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "iuytuituiti"], ["commentor_id", 3], ["commentable_type", "Review"], ["commentable_id", 100], ["created_at", 2017-03-20 22:07:10 UTC], ["updated_at", 2017-03-20 22:07:10 UTC]]

  def edit
    @comment = Comment.find(params[:id])
    @review = Review.find(params[:review_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]

  def update
    @comment = Comment.find(params[:id])
    @review = Review.find(params[:review_id])
    @comment.update(comments_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "making a comment and editting it "], ["updated_at", 2017-03-20 22:58:26 UTC], ["id", 1]]

  def destroy
    @comment = Comment.find(params[:id])
    @review = Review.find(params[:review_id])
    @comment.delete
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]