app/controllers/companies_controller.rb

  def index
    # WelcomeMailer.signup_email.deliver
    # WelcomeMailer.signup_email.deliver_now
    #@companies = sorted_companies # helper method
    # @companies = Company.all
    @companies= top_four
    if params[:search]
      @companies = Company.search(params[:search])
---
SELECT "companies".* FROM "companies"

  def show
    @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]