app/controllers/reviews_controller.rb

	def new
		@review = Review.new
		@company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]

	def create
		@company = Company.find(params[:company_id])
		@review = @company.reviews.new (review_params)
		@review.reviewer = current_user
		if @review.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
INSERT INTO "reviews" ("body", "company_id", "reviewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "My experience here has been wonderful. It's great."], ["company_id", 7], ["reviewer_id", 2], ["created_at", 2017-03-20 23:00:00 UTC], ["updated_at", 2017-03-20 23:00:00 UTC]]

	def show
		@review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]

	def edit
		@review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]

	def update
		@review = Review.find(params[:id])
		@company = @review.company
		@review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
UPDATE "reviews" SET "body" = $1, "anonymous" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["body", "[\"edit this\""], ["anonymous", true], ["updated_at", 2017-03-20 18:02:25 UTC], ["id", 100]]

	def like
		@review = Review.find(params[:id])
		@review.likes.create!(liker_id: current_user.id)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]
INSERT INTO "likes" ("liker_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["liker_id", 2], ["likeable_type", "Review"], ["likeable_id", 99], ["created_at", 2017-03-20 18:45:54 UTC], ["updated_at", 2017-03-20 18:45:54 UTC]]

	def unlike
		p @review = Review.find(params[:review_id])
		p @like = Like.find(params[:id])
		@like.delete
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]

	def destroy
		@review = Review.find(params[:id])
		@comany = @review.company
		@review.destroy
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 100]]