app/controllers/search_controller.rb

  def index
    if params[:search]
      @companies = Company.search(params[:search])
---
SELECT "companies".* FROM "companies" WHERE (name LIKE '%sdgsgdfg%')